In [1]:
pip install mysql-connector-python scikit-learn

Defaulting to user installation because normal site-packages is not writeable
Collecting mysql-connector-python
  Downloading mysql_connector_python-9.4.0-cp312-cp312-win_amd64.whl.metadata (7.7 kB)
Requirement already satisfied: scikit-learn in c:\programdata\anaconda3\lib\site-packages (1.5.1)
Requirement already satisfied: numpy>=1.19.5 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.26.4)
Requirement already satisfied: scipy>=1.6.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.13.1)
Requirement already satisfied: joblib>=1.2.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (3.5.0)
Downloading mysql_connector_python-9.4.0-cp312-cp312-win_amd64.whl (16.4 MB)
   ---------------------------------------- 0.0/16.4 MB ? eta -:--:--
   --- ------------------------------------ 1.6/16.4 MB 10.5 MB/s eta 0:00:02
   --------- ------------------------------ 3.9/16.4 MB 11.2 MB/s eta 0:00:02
   --------------- ------------------------ 6.3/16.4 MB 11.4 MB/s eta 0:00:01
   ----------------------- ---------------- 9.4/16.4 MB 12.0 MB/s eta 0:00:01
   ---------------------------- ----------- 11.5/16.4 MB 12.2 MB/s eta 0:00:01
   --------------------------------- ------ 13.9/16.4 MB 11.3 MB/s eta 0:00:01
   ---------------------------------------  16.3/16.4 MB 11.4 MB/s eta 0:00:01
   ---------------------------------------- 16.4/16.4 MB 10.9 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.4.0
Note: you may need to restart the kernel to use updated packages.

In [37]:
import mysql.connector
import pandas as pd

In [39]:
conn= mysql.connector.connect(
    host="localhost",
    user="root",
    password="Chetu@123",
    database="company_db"
)

In [40]:
# Create cursor to execute SQL
cursor = conn.cursor()

In [25]:
# Query the table
query = "SELECT experience, age, education_level, salary FROM employees"
cursor.execute(query)

In [27]:
# Fetch all data
rows = cursor.fetchall()

In [29]:
df = pd.DataFrame(rows,columns=['Experience', 'Age', 'Education_Level', 'Salary'])

In [31]:
df

   Experience  Age  Education_Level   Salary
0           1   22                1  25000.0
1           3   25                2  40000.0
2           5   28                3  55000.0
3           7   30                3  70000.0
4          10   35                4  90000.0

In [33]:
cursor.close()
conn.close()

In [47]:
#If your data grows large, you can even query directly with SQL conditions:
query = "SELECT * FROM employees"
df = pd.read_sql(query, conn)

C:\Users\chethan kiruvase\AppData\Local\Temp\ipykernel_19512\1028058394.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [49]:
df

   id  experience  age  education_level   salary
0   1           1   22                1  25000.0
1   2           3   25                2  40000.0
2   3           5   28                3  55000.0
3   4           7   30                3  70000.0
4   5          10   35                4  90000.0

In [51]:
df.iloc[:,:2]

   id  experience
0   1           1
1   2           3
2   3           5
3   4           7
4   5          10